In [1]:
import sqlite3
import pandas as pd

In [2]:
# create connection 
con = sqlite3.connect("db.sqlite")

In [3]:
# create dataframe
df = pd.read_sql_query("SELECT * FROM students",con)
df

,num,name,grade,school,gender,birthday,gpa,address,phone
0,1,Vicky Sui,10,Mark Kapple High School,Female,2005-01-01,3.6,1041 S. Garfield Ave,6268841444

In [ ]:
export = df.to_csv("")

In [6]:
con.close()